artillery.yml
# artillery.yml — Artillery Load Test для CatVRF маркетплейса
#
# Сценарии:
#   1. Ramp-up сессий пользователей
#   2. Сессия с платежом (критичный путь)
#   3. Сессия рекомендаций + поиска
#
# Запуск:
#   artillery run artillery.yml
#   artillery run --output report.json artillery.yml && artillery report report.json

config:
  target: 'http://localhost'
  environments:
    production:
      target: 'https://api.catvrf.ru'
  http:
    timeout: 10
    pool: 50
    maxSockets: 300
  defaults:
    headers:
      Content-Type: 'application/json'
      Accept: 'application/json'
      Authorization: 'Bearer {{ $processEnvironment.API_TOKEN }}'
      X-Tenant-ID: '{{ $processEnvironment.TENANT_ID }}'

  phases:
    # Phase 1: Ramp-up
    - duration: 120
      arrivalRate: 10
      rampTo: 200
      name: "Ramp-up: 10 → 200 req/s"

    # Phase 2: Sustained load
    - duration: 300
      arrivalRate: 200
      name: "Sustained load: 200 req/s"

    # Phase 3: Spike
    - duration: 60
      arrivalRate: 1000
      name: "Spike: 1000 req/s"

    # Phase 4: Post-spike recovery
    - duration: 120
      arrivalRate: 200
      name: "Recovery"

    # Phase 5: Soak (low volume, long duration)
    - duration: 1800
      arrivalRate: 50
      name: "Soak: 30 min at 50 req/s"

  ensure:
    p99: 500
    p95: 200
    maxErrorRate: 1

  plugins:
    metrics-by-endpoint:
      useOnlyRequestNames: true

scenarios:
  # ── Сценарий 1: Просмотр рекомендаций ──────────────────────────────────
  - name: "Browse Recommendations"
    weight: 40
    flow:
      - get:
          url: "/api/wallet/balance"
          name: "GET /wallet/balance"
          expect:
            - statusCode:
                - 200
                - 401

      - get:
          url: "/api/recommendations?vertical=beauty&limit=10"
          name: "GET /recommendations"
          expect:
            - statusCode:
                - 200
                - 204
                - 429

      - get:
          url: "/api/search?q=стрижка&limit=20"
          name: "GET /search"
          expect:
            - statusCode:
                - 200
                - 429

  # ── Сценарий 2: Платёжный путь ──────────────────────────────────────────
  - name: "Payment Flow"
    weight: 30
    flow:
      - post:
          url: "/api/payments/init"
          name: "POST /payments/init"
          json:
            amount: 15000
            currency: "RUB"
            idempotency_key: "{{ $guid }}"
            provider: "tinkoff"
          expect:
            - statusCode:
                - 200
                - 201
                - 202
                - 422
                - 429
          capture:
            - json: "$.id"
              as: "payment_id"

      - think: 2

      - get:
          url: "/api/payments/{{ payment_id }}/status"
          name: "GET /payments/status"
          ifTrue: "payment_id"
          expect:
            - statusCode:
                - 200
                - 404

  # ── Сценарий 3: Вишлист ─────────────────────────────────────────────────
  - name: "Wishlist Operations"
    weight: 20
    flow:
      - post:
          url: "/api/wishlist/add"
          name: "POST /wishlist/add"
          json:
            item_type: "product"
            item_id: "{{ $randomInt(1, 1000) }}"
          expect:
            - statusCode:
                - 200
                - 201
                - 409
                - 422

      - get:
          url: "/api/wishlist"
          name: "GET /wishlist"
          expect:
            - statusCode:
                - 200

  # ── Сценарий 4: Fraud simulation ────────────────────────────────────────
  - name: "Fraud Probe"
    weight: 10
    flow:
      # Replay attack
      - post:
          url: "/api/payments/init"
          name: "POST /payments/init (replay)"
          json:
            amount: 99999999
            currency: "RUB"
            idempotency_key: "fixed-replay-key-artillery"
          expect:
            - statusCode:
                - 200
                - 201
                - 409
                - 429
                - 422

      - post:
          url: "/api/payments/init"
          name: "POST /payments/init (replay again)"
          json:
            amount: 99999999
            currency: "RUB"
            idempotency_key: "fixed-replay-key-artillery"
          expect:
            - statusCode:
                - 200
                - 201
                - 409
                - 429
                - 422

      # SQL injection probe
      - get:
          url: "/api/search?q=%27%3B%20DROP%20TABLE%20users%3B%20--"
          name: "GET /search (sqli probe)"
          expect:
            - statusCode:
                - 200
                - 400
                - 422